## Data Saturation
Developed by Ajmal Quraishi\
Date: 22-oct-2023\
E-mail: ajmalquraishi98@gmail.com

In [2]:
import pandas as pd
import seaborn as sns

titanic = sns.load_dataset('titanic')
df = titanic
df.dtypes[df.dtypes == 'object']
titanic[['pclass', 'survived', 'sex', 'age', 'sibsp', 'parch', 'embarked']]

     pclass  survived     sex   age  sibsp  parch embarked
0         3         0    male  22.0      1      0        S
1         1         1  female  38.0      1      0        C
2         3         1  female  26.0      0      0        S
3         1         1  female  35.0      1      0        S
4         3         0    male  35.0      0      0        S
..      ...       ...     ...   ...    ...    ...      ...
886       2         0    male  27.0      0      0        S
887       1         1  female  19.0      0      0        S
888       3         0  female   NaN      1      2        S
889       1         1    male  26.0      0      0        C
890       3         0    male  32.0      0      0        Q

[891 rows x 7 columns]

In [3]:
titanic[titanic.dtypes[df.dtypes=='float'].index]

      age     fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns]

In [4]:
titanic[['sex']][0:17:7]

       sex
0     male
7     male
14  female

In [5]:
titanic[['age', 'sibsp', 'parch']][0:17:2]

     age  sibsp  parch
0   22.0      1      0
2   26.0      0      0
4   35.0      0      0
6   54.0      0      0
8   27.0      0      2
10   4.0      1      1
12  20.0      0      0
14  14.0      0      0
16   2.0      4      1

In [6]:
titanic['Ajmal']='Karachi'
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,Ajmal
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,Karachi
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,Karachi
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,Karachi
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,Karachi
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,Karachi
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,Karachi
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,Karachi
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,Karachi
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,Karachi
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,Karachi

In [7]:




titanic.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,Ajmal
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,Karachi
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,Karachi
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,Karachi
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,Karachi
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,Karachi
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True,Karachi
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True,Karachi
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False,Karachi
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False,Karachi
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False,Karachi

In [8]:
titanic['sex'][0:10]

0      male
1    female
2    female
3    female
4      male
5      male
6      male
7      male
8    female
9    female
Name: sex, dtype: object

In [9]:
titanic['age'][0:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64

In [11]:
titanic['sex'][0:10]
a = titanic['sex'][0:10]
type(a)

pandas.core.series.Series

In [12]:
l = ['a0', 'a1', 'a2', 'a3', 'a4', 'a5', 'a6', 'a7', 'a8', 'a9']
pd.Series(a, index=l)

a0    NaN
a1    NaN
a2    NaN
a3    NaN
a4    NaN
a5    NaN
a6    NaN
a7    NaN
a8    NaN
a9    NaN
Name: sex, dtype: object

In [13]:
pd.Series(list(a),index=l)

a0      male
a1    female
a2    female
a3    female
a4      male
a5      male
a6      male
a7      male
a8    female
a9    female
dtype: object

In [14]:
q1 = pd.Series([11,12,13,14,15,16,17,18,19,20],index=[1,2,3,4,5,6,7,8,9,10])
q1

1     11
2     12
3     13
4     14
5     15
6     16
7     17
8     18
9     19
10    20
dtype: int64

In [24]:
q2 = pd.Series([21,22,23,24,25,26,27,28,29,30],index=[1,2,3,4,5,6,7,8,9,10])
q2

1     21
2     22
3     23
4     24
5     25
6     26
7     27
8     28
9     29
10    30
dtype: int64

In [25]:
w =pd.concat([q1,q2])
w[1]

1    11
1    21
dtype: int64

In [26]:

w[1]

1    11
1    21
dtype: int64